tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
brew "autoconf"
brew "freetype"
brew "python@3.12"
brew "carthage"
brew "cmake"
brew "eza"
brew "ffmpeg"
brew "pinentry"
brew "gnupg"
brew "gource"
brew "imagemagick"
brew "make"
brew "node"
brew "openconnect"
brew "pinentry-mac"
brew "postgresql@16"
brew "pre-commit"
brew "putty"
brew "ruby@3.1"
brew "scrcpy"
brew "telnet"
brew "yt-dlp"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "adobe-creative-cloud"
cask "airmedia"
cask "android-platform-tools"
cask "angry-ip-scanner"
cask "bitwarden"
cask "devutils"
cask "discord"
cask "docker"
cask "fantastical"
cask "git-credential-manager"
cask "insomnia"
cask "iterm2"
cask "jetbrains-toolbox"
cask "macfuse"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-remote-desktop"
cask "microsoft-teams"
cask "multipass"
cask "pgadmin4"
cask "postman"
cask "proxyman"
cask "slack"
cask "spotify"
cask "temurin"
cask "temurin@17"
cask "transmission"
cask "visual-studio-code"
cask "zoom"
vscode "dan-c-underwood.arm"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "mechatroner.rainbow-csv"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "stmicroelectronics.stm32-vscode-extension"
vscode "trond-snekvik.gnu-mapfiles"
vscode "twxs.cmake"
vscode "zixuanwang.linkerscript"
